glm-disagg/results/concurrency/agg_tp4/result_mc12.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-agg
  Decode pod:   ms-glm-agg-llm-d-modelservice-decode-65894c7847-cj8xf
  Decode log:   results/agg_tp4//decode_mc12.log
  Metrics from: agg pod  IP: 10.244.2.66 (port: 8000)

Starting decode pod log capture to results/agg_tp4//decode_mc12.log ...

==============================================
Running Concurrency Sweep (timeout: 900s)
  Target: glm-agg | Max Concurrency: 12
==============================================
SWEEP_START
CONFIG: target=glm-agg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=4
TARGET_DURATION: 120s  MIN_PROMPTS: 200
CONCURRENCY_LEVELS: 12

CALIBRATION: concurrency=12 num_prompts=20
vllm bench serve --base-url $(just _url glm-agg) --model $(just _model glm-agg) --dataset-name random --random-input-len 4096 --random-output-len 256 --max-concurrency 12 --request-rate 4096 --seed $(date +%M%H%M%S) --num-prompts 20 --ignore-eos
#!/usr/bin/env bash
URL=$(just _url glm-agg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-agg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
INFO 02-27 05:31:44 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 05:31:44 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 05:31:44 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 05:31:47 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f762ecc2ca0>, seed=31053141, num_prompts=20, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-agg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=12, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-be57efa9-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 05:31:49 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/20 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 12
100%|██████████| 20/20 [00:16<00:00,  1.22it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     20        
Failed requests:                         0         
Maximum request concurrency:             12        
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  16.34     
Total input tokens:                      81900     
Total generated tokens:                  5120      
Request throughput (req/s):              1.22      
Output token throughput (tok/s):         313.27    
Peak output token throughput (tok/s):    756.00    
Peak concurrent requests:                19.00     
Total token throughput (tok/s):          5324.37   
---------------Time to First Token----------------
Mean TTFT (ms):                          2738.04   
Median TTFT (ms):                        2933.85   
P99 TTFT (ms):                           5025.99   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.11     
Median TPOT (ms):                        22.49     
P99 TPOT (ms):                           32.95     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.11     
Median ITL (ms):                         15.88     
P99 ITL (ms):                            433.42    
==================================================
COMPUTED_NUM_PROMPTS: 200 (throughput=5324.37 tok/s, timeout=300s)

==============================================
Snapshotting Prometheus metrics (pre-benchmark)
==============================================
  queue_time:   sum=125.473207  count=946
  prefill_time: sum=1136.203947  count=946

BENCH_RUN: concurrency=12 num_prompts=200 timeout=300s
vllm bench serve --base-url $(just _url glm-agg) --model $(just _model glm-agg) --dataset-name random --random-input-len 4096 --random-output-len 256 --max-concurrency 12 --request-rate 4096 --seed $(date +%M%H%M%S) --num-prompts 200 --ignore-eos
#!/usr/bin/env bash
URL=$(just _url glm-agg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-agg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
INFO 02-27 05:32:10 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 05:32:10 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 05:32:10 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 05:32:12 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fc3a5712ca0>, seed=32053207, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-agg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=12, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=4096.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-3bdff113-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 05:32:14 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/200 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 4096.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 12
100%|██████████| 200/200 [02:33<00:00,  1.31it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Maximum request concurrency:             12        
Request rate configured (RPS):           4096.00   
Benchmark duration (s):                  153.23    
Total input tokens:                      819000    
Total generated tokens:                  51200     
Request throughput (req/s):              1.31      
Output token throughput (tok/s):         334.15    
Peak output token throughput (tok/s):    756.00    
Peak concurrent requests:                20.00     
Total token throughput (tok/s):          5679.16   
---------------Time to First Token----------------
Mean TTFT (ms):                          2409.42   
Median TTFT (ms):                        2924.38   
P99 TTFT (ms):                           4624.45   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          26.17     
Median TPOT (ms):                        24.41     
P99 TPOT (ms):                           33.95     
---------------Inter-token Latency----------------
Mean ITL (ms):                           26.17     
Median ITL (ms):                         16.05     
P99 ITL (ms):                            824.91    
==================================================
BENCH_RUN_END: concurrency=12

==============================================
Sweep Completed (exit 0)
==============================================
SWEEP_END

==============================================
Snapshotting Prometheus metrics (post-benchmark)
==============================================
  queue_time:   sum=173.333609  count=1146
  prefill_time: sum=1451.942251  count=1146

==============================================
Prometheus Metrics Summary (concurrency=12)
==============================================
PROMETHEUS_METRICS: concurrency=12
  request_queue_time:   avg = 0.239302 s  (sum_delta=47.8604, count_delta=200)
  request_prefill_time: avg = 1.578692 s  (sum_delta=315.7383, count_delta=200)

Stopping log captures...
Decode log:  results/agg_tp4//decode_mc12.log (19 lines, 8.0K)